In [1]:
import pandas as pd

data = {
    'cust_id': [101, 102, 103, 104],
    'name': ['rick', 'morty', 'pickle', 'jerry']
}

customer = pd.DataFrame(data)
customer

   cust_id    name
0      101    rick
1      102   morty
2      103  pickle
3      104   jerry

In [2]:
import pandas as pd

data = {
    'order_id': ['OR1', 'OR3', 'OR23', 'OR42'],
    'cust_id': [102, 105, 101, 102],
    'amount': [1200, 650, 120, 989]
}

orders = pd.DataFrame(data)
orders

  order_id  cust_id  amount
0      OR1      102    1200
1      OR3      105     650
2     OR23      101     120
3     OR42      102     989

In [3]:
m1 = pd.merge(customer, orders, on='cust_id', how='left')
m1

   cust_id    name order_id  amount
0      101    rick     OR23   120.0
1      102   morty      OR1  1200.0
2      102   morty     OR42   989.0
3      103  pickle      NaN     NaN
4      104   jerry      NaN     NaN

In [8]:
m2 =  m1[m1.name == 'morty'].amount.sum()
# This will convert nan values to 0

In [9]:
m2

2189.0